tap "homebrew/science"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"
tap "caskroom/versions"
tap crisidev/homebrew-chunkwm

cask "java"
brew "git"

brew "aspell"
brew "chunkwm"
brew "dep"
brew "exercism"
brew "glide"
brew "go"
brew "heroku"
brew "hub"
brew "koekeishiya/formulae/khd"
brew "libusb"
brew "mas"
brew "neovim"
brew "nmap"
brew "node"
brew "opencv"
brew "opencv3"
brew "openssl"
brew "pkg-config"
brew "python3"
brew "readline"
brew "ruby"
brew "ruby-build"
brew "socat"
brew "tree"
brew "tmux"
brew "watch"
brew "wget"

cask "alfred"
cask "atom"
cask "dash"
cask "docker"
cask "eagle"
cask "electron"
cask "etcher"
cask "firefoxdeveloperedition"
cask "icons8"
cask "iterm2"
cask "kindle"
cask "licecap"
cask "osxfuse"
cask "virtualbox"
cask "vlc"
cask "wireshark"
cask "xquartz"

cask "osxfuse"
brew "ext2fuse"

mas "123D Design", id: 566042322
mas "123DMake", id: 515318186
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
