####
# install with:
# brew bundle --file Brewfile
####

## taps
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "railwaycat/emacsmacport"

# tools - source control
brew "git"
brew "jj"  # jujutsu vcs

# tools - cli
brew "lcov"
brew "tree"
brew "watch"
brew "fd"
brew "ripgrep"
brew "jq"
brew "rlwrap"
brew "hexyl"
brew "exiftool"
brew "pandoc"
brew "yt-dlp"
brew "ffmpeg"
brew "mpv"

# tools - editor
brew "neovim"

# tools - build
brew "uv"
brew "poetry"
brew "cmake"
brew "pkg-config"

# programming languages
brew "python"
brew "zig"
brew "sbcl"
brew "borkdude/brew/babashka"
brew "clojure"
brew "clojurescript"
brew "node"
brew "go"
brew "rustup"

# libraries
brew "sdl2"
brew "sdl2_image"
brew "mpg123"

# frameworks
brew "vapor"

# casks
cask "emacs-mac"
cask "firefox@developer-edition"
cask "iterm2"
cask "ghostty"
cask "qutebrowser"
cask "xquartz"
cask "phoenix"
